// Є массив [1,2,3,1,5,6,1,2,5], треба використовуючи цей масив створити новий,
// в якому будуть присутні тільки тільки ті значення які повторюються.
// Результат буде [1,2,5]
// Якщо в джерельному масиві усі значення унікальні, то створюєте новий пустий масив.

// *зробити функцію

const array = [1,1,1,1,1,2,3,1,2,2]
console.log(array)

const newArr = array.filter(function (elem, ind, arr) {
  return arr.indexOf(elem) !== ind
}) //створюємо новий масив
//використовуємо метод фільтер
//фільтруємо за елементом, індексом і масивом
//шукаємо значення яке не дорівнює індексу
//корегуємо масив і виводимо тільки ті єлементи які не повторюються
const newArr2 = newArr.filter(function (elem, ind, arr) {
  return arr.indexOf(elem) === ind
})

console.log(newArr)
console.log(newArr2)
